# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [7,14,  18,37,  33,66]  # P3/8
  - [37,36,  41,55,  60,106]  # P4/16
  - [64,58,  87,87,  180,219]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [
    [ -1, 1, conv_bn_relu_maxpool, [ 128 ] ], #              160
    [ -1, 1, Shuffle_Block, [ 256, 2 ] ], # 1-P3/8      80
    [ -1, 3, Shuffle_Block, [ 256, 1 ] ], # 2
    [ -1, 1, Shuffle_Block, [ 512, 2 ] ], # 3-P4/16     40
    [ -1, 7, Shuffle_Block, [ 512, 1 ] ], # 4
    [ -1, 1, Shuffle_Block, [ 1024, 2 ] ], # 5-P5/32     20
    [ -1, 3, Shuffle_Block, [ 1024, 1 ] ], #

  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [ 1 ] ],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   [ -1, 1, CoordAtt, [ 256 ] ],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 11], 1, Concat, [1] ],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)
   [ -1, 1, CoordAtt, [ 512 ] ],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)
   [ -1, 1, CoordAtt, [ 1024 ] ],

   [[15, 19, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


